doneadd = """تم تفعيل المجموعة ({})
ورفع المنشئ والادمنيه في البوت"""

doneadd2 = "<b>تم تفعيل المجموعة {}</b>"

doneadded = "<b>المجموعة {} مفعلة</b>"

disabled = "<b>المجموعة بالفعل معطلة {}</b>"

disabl = "<b>تم تعطيل المجموعة {} سيتم حذف البيانات المتعلقة بالمجموعة بعد 24 ساعة في حال عدم تفعيل البوت</b>"


userNocc = "عذراً لايمكنني الوصول الى (الايدي/المعرف)"

locked = "<b>بواسطة :-</b> {} <b>{} بالفعل مقفولة في المجموعة</b>" 
lock = "<b>بواسطة :-</b> {} <b>تم قفل {} في المجموعة</b>" 

unlocked = "<b>بواسطة :-</b> {} <b>{} بالفعل مفتوحة في المجموعة</b>" 
unlock = "<b>بواسطة :-</b> {} <b>تم فتح {} في المجموعة</b>"
kickbotadd = "تم طرد البوت <a href='http://t.me/{}'>{}</a>"

ADDed = "<b>بواسطة :-</b> {} <b>{} بالفعل مفعلة في المجموعة</b>" 
ADD = "<b>بواسطة :-</b> {} <b>تم تفعيل {} في المجموعة</b>" 

unADDed = "<b>بواسطة :-</b> {} <b>{} بالفعل معطلة في المجموعة</b>" 
unADD = "<b>بواسطة :-</b> {} <b>تم تعطيل {} في المجموعة</b>"

true = "✅"

false = "❎"

settings = "<b>اعدادات المجموعة - ({})</b>\n<b>✅ - مفتوحة | ❎ - مقفولة</b>"
st2 = "<b>اعدادات المجموعة - ({})\n✅ - مفعلة | ❎ - معطلة\nوقت التكرار :- ({})\nعدد التكرار :- ({})</b>"



notforyou = "عذراً الامر ليس لك"

Corder = "الغاء الامر"

doneCO = "تم الغاء الامر"
ARdoneCO = "بالفعل تم اللغاء الامر"
setRK = "<b>العضو :- </b>{} <b>تم رفعه {}</b>"
remRK = "<b>العضو :- </b>{} <b>تم تنزيله من ال{}</b>"

DsetRK = "<b>العضو :- </b>{} <b>بالفعل {}</b>"
DremRK = "<b>العضو :-  </b>{} <b>ليس {}</b>"

ban = "*تم حظر العضو* {} *من المجموعة*"
Dban = "<b>العضو </b>{} <b>بالفعل محظور من المجموعة</b>"

banall = "<b>تم حظر العضو</b> {} <b>في المجموعات</b>"
Dbanall = "<b>العضو </b>{} <b>بالفعل محظور في المجموعات</b>"

unban = "*تم الغاء حظر العضو* {} *من المجموعة*"
Dunban = "<b>العضو </b>{} <b>بالفعل غير محظور من المجموعة</b>"

unbanall = "<b>تم الغاء حظر العضو</b> {} <b>من المجموعات</b>"
Dunbanall = "<b>العضو </b>{} <b>بالفعل غير محظور من المجموعات</b>"

restricted = "*تم تقيد العضو* {} *من المجموعة*"
Drestricted = "<b>العضو </b>{} <b>بالفعل مقيد من المجموعة</b>"

unrestricted = "*تم الغاء تقيد العضو* {} *من المجموعة*"
Dunrestricted = "<b>العضو </b>{} <b>بالفعل غير مقيد من المجموعة</b>"

restrictedall = "<b>تم تقيد العضو</b> {} <b>من المجموعات</b>"
Drestrictedall = "<b>العضو </b>{} <b>بالفعل مقيد في المجموعات</b>"

unrestrictedall = "<b>تم الغاء تقيد العضو</b> {} <b>من المجموعات</b>"
Dunrestrictedall = "<b>العضو </b>{} <b>بالفعل غير مقيد في المجموعات</b>"

haveRank = "لا يمكنك حظر طرد تقيد كتم الـ{}"
haveKick = "عذراً العضو مطرود او غير موجود بالمجموعة"
delList = "مسح {}"

TKflood = "<b>تم تقيد العضو </b>{}<b> لتجاوز عدد الرسائل المحدده {} في الوقت المحدد {}</b>"

DoneSet = "<b>تم وضع {} {}</b>"


haveRc = "العضو {} بالفعل مقيد"

showlist = "قائمة {} :-\n{}"
listempty = "قائمة {} فارغة"
creatorempty = "لا يوجد منشئ"
listempty2 = "<b>القائمة فارغة</b>"
Doneblock = "<b>تم منع [{}] في المجموعة [{}]</b>"
Adoneblock = "<b>[{}] بالفعل ممنوعة بالمجموعة</b>"


StB = "<b>تم منع الملصق في المجموعة [{}]</b>"
StA = "<b>الملصق بالفعل ممنوعة في المجموعة [{}]</b>"

GfB = "<b>تم منع المتحركة في المجموعة [{}]</b>"
GfA = "<b>المتحركة بالفعل ممنوعة في المجموعة [{}]</b>"

PhB = "<b>تم منع الصوره في المجموعة [{}]</b>"
PhA = "<b>الصوره بالفعل ممنوعة في المجموعة [{}]</b>"


unDoneblock = "<b>تم الغاء منع [{}] في المجموعة [{}]</b>"
unAdoneblock = "<b>[{}] بالفعل غير ممنوعة بالمجموعة</b>"

unStB = "<b>تم الغاء منع الملصق في المجموعة [{}]</b>"
unStA = "<b>الملصق بالفعل غير ممنوعة في المجموعة [{}]</b>"

unGfB = "<b>تم الغاء منع المتحركة في المجموعة [{0}]</b>"
unGfA = "<b>المتحركة بالفعل غير ممنوعة في المجموعة [{}]</b>"

unPhB = "<b>تم الغاء منع الصوره في المجموعة [{}]</b>"
unPhA = "<b>الصوره بالفعل غير ممنوعة في المجموعة [{}]</b>"
blocklist = "<b>قوائم {} الخاصة بمجموعة {}</b>"
banlist = "<b>قوائم العام الخاصة بالبوت</b>"


blocklist2 = "المنع"
replylist = "الردود"
replylistBot = "ردود البوت"
BlocklistRm = "مسح الكلمات الممنوعة"
replylistRm = "مسح ردود الكلمات"
STreplylistRm = "مسح ردود الملصقات"
VOreplylistRm = "مسح ردود الصوتيات"
GFreplylistRm = "مسح ردود المتحركات"

BlocklistEm = "قائمة الكلمات الممنوعة فارغة"
replylistEm = "قائمة الكلمات فارغة"
STreplylistEm = "قائمة الملصقات فارغة"
GFreplylistEm = "قائمة المتحركات فارغة"
VOreplylistEm = "قائمة الصوتيات فارغة"

Blocklistone = "الغاء منع"
Delall = "يمكنك مسح القائمة بالضغط على 🔽"
Delall2 = "الغاء منع الكل"
DoneUNblock = "تم الغاء المنع"

DelallR = "يمكنك مسح الردود بالضغط على 🔽"
Delall2R= "مسح الكل"

Donewel = "<b>تم تغير الترحيب الى {}</b>"

Sendreply = "الان ارسل الرد الذي تريد وضعة لـ %s\n<b>{fn}</b> : لعرض الاسم\n<b>{us}</b> : لعرض المعرف\n<b>{id}</b> : لعرض الايدي\n<b>{rk}</b> : لعرض الموقع\n<b>{cn}</b> : لعرض اسم المجموعة\nيمكنك استخدم الـhtml"

SRtext = "<b>تم حفظ الرد الخاص بـ {}</b>"
SRst = "<b>تم حفظ الملصق الخاص بـ {}</b>"
SRgf = "<b>تم حفظ المتحركه الخاص بـ {}</b>"
SRvo = "<b>تم حفظ البصمة الخاص بـ {}</b>"

Drp = "تم حذف الرد الخاص بـ <b>{}</b>"
Norp = "لا يوجد رد خاص بـ <b>{}</b>"
Yrp = "عذرا يوجد رد خاص بـ <b>{}</b>"
allbandel = "مسح المحظورين عام"

alltkdel = "مسح المكتومين عام"

allbanE = "قائمة المحظورين عام فارغه"

alltkE = "قائمة المكتومين عام فارغه"

Ddelbanall = "تم حذف قائمة المحظورين عام"

Ddeltkall = "تم حذف قائمة المكتومين عام"

Dsetname = "<b>تم تغير اسم المجموعة الى {}</b>"
Dsetabout = "<b>تم تغير وصف المجموعة الى {}</b>"

Dsetphoto = "<b>تم تغير صورة المجموعة</b>"
Dsetlk = "<b>تم تغير رابط المجموعة الى</b> {}"
yourmsgs = "<b>رسائلك : {}</b>"
youredits = "<b>سحكاتك : {}</b>"

youraddcontact = "<b>جهاتك : {} \n تم حذف جهاتك</b>"

yes = "نعم"
no = "لا"
kickme = "<b>هل انت متاكد؟</b>"
Dkickme ="تم طردك بأرادتك"
Nkickme = "تم الغاء الامر"

Rsudo = "مطور اساسي"
Rsudos = "مطور"
Rcreator = "منشئ الكروب"
Rowner = "مدير الكروب"
Radmin = "ادمن"
Rvip = "عضو مميز"
Rmember = "عضو"

Rrank = "رتبتك :- {}"
Rmsgs = "رسائلك :- ({})"
Rrate = "تفاعلك :- ({})"
Redits = "سحكاتك :- ({})"
RID = "ايديك :- {}"
RIDPH = "اسمك :- {}\n ايديك :- {}"
RIDPHs = "اضغط لاظهار معلوماتك"
DPROadmins = "<b>تم رفع ادمنية المجموعة في البوت</b>"
DsetSudosShow = "<b>تم تغير كليشه المطور</b>"

DsetSudosShowE = "عذرأ توجد مشكلة في html الرسالة"



sendto = "<b>اين تريد ارسالها ؟</b>"

Dpinmsg = "<b>تم تثبيت الرسالة</b>"
Dunpinmsg = "<b>تم الغاء تثبيت الرسالة</b>"

showstats = "<b>احصائيات البوت :-\nعدد المجموعات :- ({})\nعدد المحادثات :- ({})</b>"

showGPlk = "<b>رابط المجموعة :-</b>\n{}"

PRsendtoGP = "<b>يتم الان ارسال الرسالة الى المجموعات</b>"

PRsendtoPR = "<b>يتم الان ارسال الرسالة الى المحادثات</b>"

DsendtoGP = "تم ارسال الرسالة الى المجموعات\nتم ارسالها الى :- <b>({})</b>\nلم يتم ارسالها الى :- <b>({})</b>"
DsendtoPR = "تم ارسال الرسالة الى المحادثات\nتم ارسالها الى :- <b>({})</b>\nلم يتم ارسالها الى :- <b>({})</b>"


clickTOpv = "عرض بالمحادثة"

Toolong = "عذرا الرسالة طويلة اضغظ على الزر لعرضها في محادثه البوت"

DoneDelList = "تم مسح القائمة"
SetAuto = "تم وضع عدد التفعيل التلقائي :- ({})"

NoMember = "عذراً العضو غير موجود بالمجموعة"

cTsudo = "لا يمكنك (حظر عام/كتم عام) مطور"

Toolow = "عذراً عدد الكروب اقل من ({})"

GiveMEall = "عذرا لايمكنني تفعيل المجموعة رجاءا امنحني كل خواص الادمن"

DoneleaveChat = "تم المغادرة من المجموعة"


banclick = "{} تم حظرك من استخدام الازرار لمدة دقيقتين بسبب تكرارك"

NoDeleted = "عذراً لا يوجد حسابات محذوفه في المجموعة"
LenDeleted = "يوجد {} حساب محذوف سيتم طردهم من المجموعة"


AdminO = """قائمة الادمنية :-

حظر <معرف | رد | ايدي>
تقيد <معرف | رد | ايدي>
المقيدون - المكتومين - المحظورين

وضع صورة <بالرد على صورة>
وضع رابط <رابط المجموعة>
وضع وصف <وصف>
وضع اسم <اسم>"""

OwnerO = """قائمة المدراء :-

(رفع|تنزيل) ادمن <معرف|بالرد|ايدي>
(رفع|تنزيل) مميز <معرف|بالرد|ايدي>
(الادمنية|المميزين)

(الغاء|منع) <بالرد|جملة>
(اضف|حذف) رد <جملة>
قائمة (الردود|المنع)

وضع ترحيب <جملة>
(عدد|وقت) التكرار <عدد>

تعين الايدي <جملة>
مسح الايدي

(تفعيل|تعطيل) 
الترحيب | التكرار | الردود
ردود البوت | اطردني | الايدي
الايدي بالصورة | الايدي بالازرار"""

CreatorO = """قائمة المنشئ :-

(رفع|تنزيل) مدير <معرف|بالرد|ايدي>
(تفعيل|تعطيل) <التثبيت>

مسح <المحذوفين|البوتات>
تغير اللغه"""

SudosO = """اوامر المطورين :-

(تفعيل|تعطيل) المجموعة
(رفع|تنزيل) منشئ <معرف|بالرد|ايدي>

(اضف|حذف) للبوت <جملة>
قائمة ردود البوت"""

SudoO = """اوامر المطور الاساسي :-

(رفع|تنزيل) مطور <معرف|بالرد|ايدي>
(حظر|كتم) عام <معرف|بالرد|ايدي>
الغاء (حظر|كتم) العام <معرف|بالرد|ايدي>
(قوائم العام|المطورين>

(اذاعه|توجيه) <بالرد>
مغادرة <ايدي المجموعة>
(المجموعات|روابط المجموعات)

وضع امر المطور <كليشه>
(تفعيل|تعطيل) <التلقائي>
عدد التلقائي <عدد>
طرد المحذوفين"""

Showall = """اهلا بك في بوت <a href=\"t.me/nbbot\">NewBot</a>
يمكنك استخدام هذه الاوامر 🔽"""

LockO = """اوامر القفل والفتح :-

{ قفل|فتح }
الروابط | البوتات | الفيديو
الملاحظه | الاغاني | الصوت
المتحركه | الصور | الانلاين
الماركدون | الجهات | الملفات
الملصقات | التوجيه | المعرف
الانكليزيه | العربيه | التاك
الاشعارات | التعديل | الكلايش

ملاحظه :- انصح بأستخدام امر (الاعدادات) للسهولة."""

lockC = "اوامر القفل"
AdminC = "اوامر الادمن"
OwnerC = "اوامر المدير"
CreatorC = "اوامر المنشئ"
SudosC = "اوامر المطور"
SudoC = "اوامر المطور الاساسي"


ShowGPN = "{}- الاسم :- ({})\nالايدي :- (<code>{}</code>)"

AsPh = '''💬 {}
📊 {}
📇 {}'''


Dulang = "تم تحديث لغات البوت"

SudoOnle = "عذراً الامر للمطور الاساسي"

Chlang = "Choose the language - اختر اللغه"


lang ={"ar":"🇮🇶 AR-Classic","en":"🇺🇸EN","arem":"🇮🇶 AR-Emoji"}


IDnPT = '''ايديك :- {id}
يوزرك :- {us}
موقعك :- {rk}
رسائلك :- {msgs}
سحكاتك :- {edits}
تفاعلك :- {rate}'''


DsetIDShow = "<b>تم تغير كليشه الايدي</b>"
Ddelid = "تم مسح الايدي سيتم عرض كليشه الايدي الاساسيه"

NoBots= "عذراً لا يوجد بوتات في المجموعة"
LenBots = "يوجد {} بوتات سيتم طردهم من المجموعة"

Wres = "سيتم اعادة تشغيل البوت الرجاء الانتظار"


MoreInfo = "معرفه المزيد؟"

CKgps = "فحص المجموعات"

Dckg = "\nتم فحص المجموعات وتم حذف {}"

ckpr = "يتم الان فحص المجموعات قد يستغرق القليل من الوقت"

true2 = "✔️"
false2 = "✖️"

settingsRes = """اعدادات التقيد بالمجموعة
✔️꒐ مفتوحه | ✖️꒐ مقفوله"""

pk = "⏪"
fr = "⏩"
hide = "اخفاء"

sors = "البوت [{}] من سورس [NewBot](t.me/nbbot)"

dellink = "رابط حذف حساب التلكرام 🔽"



botstart = """👋🏻꒐ اهلا بك في {} بوت حماية المجموعات
⏺꒐ يمكنك اضافتي <a href=\"http://t.me/{}?startgroup=botstart\">بالضغط هنا</a>
⎯ ⎯ ⎯ ⎯"""

Tban = "حظر"
Tres = "تقيد"

fset = "وضع التكرار :- {}"
Tfset = "يمكنك تغير وضع التكرار الى ( تقيد | حظر )"


NOaddfiles = "عذراً لا توجد ملفات من <a href=\"http://t.me/nbbot\">(NewBot)</a>"

addFiles = """اليك الملفات المتوفره من <a href=\"http://t.me/nbbot\">(NewBot)</a>
يمكنك تحميل الملف بالضغظ علي اسم الملف"""

Dua = """تم (تحميل/تحديث) الملف ({})
يمكنك تفعيله عن طريق ارسال الملفات"""

Files = """اليك الملفات الموجودة في البوت 
يمكنك تفعيل وتعطيل الملف بالضغط"""
